test/devices/fixtures/set_ntp_request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope
 xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope"
xmlns:tt="http://www.onvif.org/ver10/schema"
 xmlns:tds="http://www.onvif.org/ver10/device/wsdl">
  <soapenv:Body>
    <tds:SetNTP>
      <tds:FromDHCP>false</tds:FromDHCP>
      <tds:NTPManual>
        <tt:Type>IPv4</tt:Type>
        <tt:IPv4Address>6.6.6.0</tt:IPv4Address>
      </tds:NTPManual>
    </tds:SetNTP>
  </soapenv:Body>
</soapenv:Envelope>
